Update Architecture.md
